app/controllers/api/activity_controller.rb

    def index
        if params[:user_id] && params[:user_id] != "undefined"
            @activities = Activity.where(user_id: params[:user_id])
        else
            if params[:route_id] != "undefined"
                @activities = Activity.where(route_id: params[:route_id])
            else
                @activities = Activity.all
            end
        end
        @activities = @activities.order("date desc")
        # debugger
        if params[:recentDays] && params[:recentDays] != ""
            start_date = Date.today - params[:recentDays].to_i
            # debugger
            @activities = @activities.where("date > (?)", start_date)
        end
        # debugger
        if params[:sport] && params[:sport] != ""
            @activities = @activities.where("sport = (?)", params[:sport])
        end
        # debugger
        if params[:keywords] && params[:keywords] != ""
            @activities = @activities.where("title ilike ?", "%#{params[:keywords]}%")
        end
        # debugger
        # @activities = @activities.offset(0).limit(10)
        @cnt = @activities.length;
        if params[:cnt] && params[:offset] && params[:cnt] != ""
            @activities = @activities.limit(params[:cnt]).offset(params[:offset])
---
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = $1  [["user_id", 0]]
SELECT "activities".* FROM "activities"
SELECT  "activities".* FROM "activities" WHERE "activities"."user_id" = $1 LIMIT $2  [["user_id", 0], ["LIMIT", 11]]