app/controllers/api/route_controller.rb

    def index
        # debugger
        if params[:user_id] != "undefined"
            @routes = Route.where(user_id: params[:user_id]).order("created_at desc")
        else
            @routes = Route.all.order("created_at desc")
        end
        if params[:recentDays] && params[:recentDays] != ""
            start_date = Date.today - params[:recentDays].to_i
            # debugger
            @routes = @routes.where("created_at > (?)", start_date)
        end
        # debugger
        if params[:keywords] && params[:keywords] != ""
            @routes = @routes.where("name ilike ?", "%#{params[:keywords]}%")
        end
        @cnt = @routes.length;
        if params[:cnt] && params[:offset] && params[:cnt] != ""
            @routes = @routes.limit(params[:cnt]).offset(params[:offset])
---
SELECT "routes".* FROM "routes" WHERE "routes"."user_id" = $1  [["user_id", 1]]
SELECT "routes".* FROM "routes"
SELECT  "routes".* FROM "routes" WHERE "routes"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 11]]