app/views/api/users/_user.json.jbuilder

json.extract! user, :id, :username, :email
json.routes user.routes.order("created_at").pluck(:id)
---
SELECT "routes"."id" FROM "routes" WHERE "routes"."user_id" = $1 ORDER BY created_at  [["user_id", 1]]

# debugger
if user.activities.length > 0
    json.latest user.activities.order("date").last, :title, :date, :duration, :sport
---
SELECT  "activities".* FROM "activities" WHERE "activities"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."user_id" = $1 ORDER BY date DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]