app/views/api/users/_user.json.jbuilder

json.extract! user, :id, :username, :email
json.routes user.routes.pluck(:id)
---
SELECT "routes"."id" FROM "routes" WHERE "routes"."user_id" = $1  [["user_id", 3]]