app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "iamusain@goldmedal.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email,pw)
        # debugger
        user = User.find_by(email: email)